# RoboMaster Optimized YOLOv5s Configuration
# Balanced model for RoboMaster armor plate detection
# Key optimizations for fine-grained classification

# Parameters
nc: 14 # RoboMaster armor classes: B1-B5, BHero, R1-R5, RHero, RQS, BQS
depth_multiple: 0.4 # Reduced from 0.5 for efficiency
width_multiple: 0.6 # Increased from 0.5 for better features
anchors:
  # Optimized for armor plate sizes
  - [5, 8, 8, 15, 12, 20] # P3/8 - small armor plates
  - [15, 25, 20, 35, 25, 50] # P4/16 - medium armor plates
  - [35, 70, 50, 90, 80, 160] # P5/32 - large armor plates

# YOLOv5 RoboMaster backbone
backbone:
  # [from, number, module, args]
  [
    [-1, 1, Conv, [64, 6, 2, 2]], # 0-P1/2
    [-1, 1, Conv, [128, 3, 2]], # 1-P2/4
    [-1, 3, C3, [128]],
    [-1, 1, Conv, [256, 3, 2]], # 3-P3/8
    [-1, 5, C3, [256]], # Reduced from 6
    [-1, 1, Conv, [512, 3, 2]], # 5-P4/16
    [-1, 7, C3, [512]], # Reduced from 9
    [-1, 1, Conv, [1024, 3, 2]], # 7-P5/32
    [-1, 3, C3, [1024]],
    [-1, 1, SPPF, [1024, 5]], # 9
  ]

# YOLOv5 RoboMaster head
head: [
    [-1, 1, Conv, [512, 1, 1]],
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 6], 1, Concat, [1]], # cat backbone P4
    [-1, 3, C3, [512, False]], # 13

    [-1, 1, Conv, [256, 1, 1]],
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 4], 1, Concat, [1]], # cat backbone P3
    [-1, 3, C3, [256, False]], # 17 (P3/8-small)

    [-1, 1, Conv, [256, 3, 2]],
    [[-1, 14], 1, Concat, [1]], # cat head P4
    [-1, 3, C3, [512, False]], # 20 (P4/16-medium)

    [-1, 1, Conv, [512, 3, 2]],
    [[-1, 10], 1, Concat, [1]], # cat head P5
    [-1, 3, C3, [1024, False]], # 23 (P5/32-large)

    [[17, 20, 23], 1, Detect, [nc, anchors]], # Detect(P3, P4, P5)
  ]